# Data Transformation

In [1]:
import pandas as pd

In [4]:

s = pd.Series(['cat', 'cow', 'dog'])
print("Series:\n")
s

Series:

0    cat
1    cow
2    dog
dtype: object

In [5]:
print("Mapping: ")

s.map({'cat': 'kitten', 'cow': 'calf'})

Mapping:

0    kitten
1      calf
2       NaN
dtype: object

In [6]:
import pandas as pd

df = pd.DataFrame(
	[('carrot', 'red', 1), 
	('papaya', 'yellow', 0),
	('mango', 'yellow', 0), 
	('apple', 'red', 0)
	], 
	columns=['species', 'color', 'type']
)

In [7]:
df

  species   color  type
0  carrot     red     1
1  papaya  yellow     0
2   mango  yellow     0
3   apple     red     0

In [11]:
print("Dataframe before Mapping: ")
print(df)

mappings = {
	'carrot': 'veg',
	'papaya': 'fruit',
    'mango':'king',
    'apple':"fruit"
}

Dataframe before Mapping:
  species   color   type
0  carrot     red    veg
1  papaya  yellow  fruit
2   mango  yellow    NaN
3   apple     red    NaN

In [12]:
mappings

{'carrot': 'veg', 'papaya': 'fruit', 'mango': 'king', 'apple': 'fruit'}

In [13]:
df['type'] = df['species'].map(mappings)
print("Dataframe after Mapping: ")
print(df)

Dataframe after Mapping:
  species   color   type
0  carrot     red    veg
1  papaya  yellow  fruit
2   mango  yellow   king
3   apple     red  fruit

In [14]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon',
'pastrami', 'honey ham', 'nova lox'],
'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [15]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [16]:
data['food'] = data['food'].str.lower()

In [18]:
data['animal'] = data.food.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [19]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
# continuous

In [20]:
bins = [18, 25, 35, 60, 100]

In [21]:
cats = pd.cut(ages, bins)

In [22]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [23]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [24]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [25]:
pd.value_counts(cats)

C:\Users\Nasir Hussain\AppData\Local\Temp\ipykernel_3524\1485279302.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [26]:
data = pd.read_csv("weight-height.csv")
data

      Gender     Height      Weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[10000 rows x 3 columns]

In [27]:
data.Weight

0       241.893563
1       162.310473
2       212.740856
3       220.042470
4       206.349801
           ...
9995    136.777454
9996    170.867906
9997    128.475319
9998    163.852461
9999    113.649103
Name: Weight, Length: 10000, dtype: float64

In [28]:
data.Weight.describe()

count    10000.000000
mean       161.440357
std         32.108439
min         64.700127
25%        135.818051
50%        161.212928
75%        187.169525
max        269.989698
Name: Weight, dtype: float64

In [29]:
bins = [64,100,150,200,250,300]

In [30]:
cats = pd.cut(data.Weight, bins)

In [31]:
pd.value_counts(cats)

C:\Users\Nasir Hussain\AppData\Local\Temp\ipykernel_3524\1485279302.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(cats)

Weight
(150, 200]    4717
(100, 150]    3857
(200, 250]    1272
(64, 100]      146
(250, 300]       8
Name: count, dtype: int64